{"id":1,"date":"2021-01-07T21:00:00","date_gmt":"2021-01-08T03:00:00","guid":{"rendered":"http:\/?p=1"},"modified":"2021-01-19T13:15:22","modified_gmt":"2021-01-19T19:15:22","slug":"welcome-to-common-rootz","status":"publish","type":"post","link":"https:\/\/www.commonroots.farm\/2021\/01\/07\/welcome-to-common-rootz\/","title":{"rendered":"Welcome to Common Roots!"},"content":{"rendered":"\n<p>Hello friends! We are <strong>Dylan and Alex<\/strong>. Welcome to our blog, <strong>Common Root<\/strong>s!<\/p>\n\n\n\n<p>We decided to start this after watching the documentary <a rel=\"noreferrer noopener\" href=\"https:\/\/kisstheground.com\/\" data-type=\"URL\" data-id=\"https:\/\/kisstheground.com\/\" target=\"_blank\"><em><span style=\"text-decoration: underline;\">Kiss The Ground<\/span><\/em><\/a> on Netflix toward the end of 2020. The documentary draws on connections between the history of our food production system, our health, and the changing climate to make a compelling argument for changing the way we grow our food.<\/p>\n\n\n\n<p>It struck a deep chord with us. Our whole lives, we&#8217;d heard about melting ice caps and rising sea levels, ocean acidification, processed foods and pesticides, and yet somehow these issues have always felt so far away from us. In other words, they haven&#8217;t felt like &#8220;our&#8221; problems. <em>Kiss The Ground<\/em> helped us reconnect with the fact that how our food is produced and how we treat the environment are having real effects on the world right now, and those effects will only be exacerbated if we keep going down the path we are on. Therefore this is definitely &#8220;our problem&#8221;.<\/p>\n\n\n\n<p>The other thing we learned from the documentary is just how in the dark we actually are about how our society produces and consumes food. Alex is a psychologist and Dylan is a software engineer, and if the apocalypse started tomorrow we probably would be the first to go because we can&#8217;t even keep a mint plant alive, much less grow a real vegetable. <\/p>\n\n\n\n<p>Enough is enough. We care deeply about the world we live in. We want to be good caretakers of the planet and our health, and we want to help others do so as well.<\/p>\n\n\n\n<p>We are going to go on a learning journey and share what we find on Common Roots. We are going to focus on understanding how the food we eat comes to be in our refrigerators and on our plates. We are going to study both conventional and organic farming, regenerative agriculture, soil science, climate change, and more broadly how the food we eat affects our health. <\/p>\n\n\n\n<p>We plan on approaching these topics with an open mind, and attempting to break these complicated systems down into their basic elements so that they are easier to understand and reason about. In our research, we will rely on scientific evidence to answer our questions and be honest about what hasn&#8217;t been studied or isn&#8217;t yet known otherwise. Through our writing, we hope to both teach and while at the same time solidifying our own understanding. Most of all, we hope to find community with other people that want to go on this journey with us. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>Hello friends! We are Dylan and Alex. Welcome to our blog, Common Roots! We decided to start this after watching the documentary Kiss The Ground on Netflix toward the end of 2020. The documentary draws on connections between the history of our food production system, our health, and the changing climate to make a compelling [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[4,3],"_links":{"self":[{"href":"https:\/\/www.commonroots.farm\/wp-json\/wp\/v2\/posts\/1"}],"collection":[{"href":"https:\/\/www.commonroots.farm\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.commonroots.farm\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.commonroots.farm\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.commonroots.farm\/wp-json\/wp\/v2\/comments?post=1"}],"version-history":[{"count":8,"href":"https:\/\/www.commonroots.farm\/wp-json\/wp\/v2\/posts\/1\/revisions"}],"predecessor-version":[{"id":28,"href":"https:\/\/www.commonroots.farm\/wp-json\/wp\/v2\/posts\/1\/revisions\/28"}],"wp:attachment":[{"href":"https:\/\/www.commonroots.farm\/wp-json\/wp\/v2\/media?parent=1"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.commonroots.farm\/wp-json\/wp\/v2\/categories?post=1"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.commonroots.farm\/wp-json\/wp\/v2\/tags?post=1"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}